## Terraform Plan for PR #31

<details>
<summary>Terraform Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_network.stack_network will be created
  + resource "docker_network" "stack_network" {
      + driver      = (known after apply)
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "ephemeral-pr-31-network"
      + options     = (known after apply)
      + scope       = (known after apply)

      + labels {
          + label = "environment"
          + value = "ephemeral"
        }
      + labels {
          + label = "pr_number"
          + value = "31"
        }
    }

  # module.app.docker_container.app will be created
  + resource "docker_container" "app" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "PR_NUMBER=31",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "ephemeral-pr-31-app"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + labels {
          + label = "environment"
          + value = "ephemeral"
        }
      + labels {
          + label = "pr_number"
          + value = "31"
        }

      + networks_advanced {
          + aliases = []
          + name    = "ephemeral-pr-31-network"
        }

      + ports {
          + external = 8031
          + internal = 80
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # module.app.docker_image.app will be created
  + resource "docker_image" "app" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "nginx:alpine"
      + repo_digest = (known after apply)
    }

  # module.db.docker_container.db will be created
  + resource "docker_container" "db" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (sensitive value)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "ephemeral-pr-31-db"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval       = "30s"
          + retries        = 3
          + start_interval = "0s"
          + start_period   = "0s"
          + test           = [
              + "CMD-SHELL",
              + "pg_isready -U ephemeral_user -d ephemeral_pr_31",
            ]
          + timeout        = "5s"
        }

      + labels {
          + label = "component"
          + value = "database"
        }
      + labels {
          + label = "environment"
          + value = "ephemeral"
        }
      + labels {
          + label = "pr_number"
          + value = "31"
        }

      + networks_advanced {
          + aliases = []
          + name    = "ephemeral-pr-31-network"
        }

      + ports {
          + external = 5463
          + internal = 5432
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }

      + volumes {
          + container_path = "/var/lib/postgresql/data"
          + volume_name    = "ephemeral-pr-31-db-data"
        }
    }

  # module.db.docker_image.db will be created
  + resource "docker_image" "db" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "postgres:15-alpine"
      + repo_digest = (known after apply)
    }

  # module.db.docker_volume.db_data will be created
  + resource "docker_volume" "db_data" {
      + driver     = (known after apply)
      + id         = (known after apply)
      + mountpoint = (known after apply)
      + name       = "ephemeral-pr-31-db-data"
    }

  # module.db.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.proxy.docker_container.proxy will be created
  + resource "docker_container" "proxy" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "PR_NUMBER=31",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "ephemeral-pr-31-proxy"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + labels {
          + label = "component"
          + value = "proxy"
        }
      + labels {
          + label = "environment"
          + value = "ephemeral"
        }
      + labels {
          + label = "pr_number"
          + value = "31"
        }

      + networks_advanced {
          + aliases = []
          + name    = "ephemeral-pr-31-network"
        }

      + ports {
          + external = 9031
          + internal = 80
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }

      + upload {
          + content    = <<-EOT
                upstream app {
                    server ephemeral-pr-31-app:80;
                }
                
                server {
                    listen 80;
                    server_name _;
                
                    location / {
                        proxy_pass http://app;
                        proxy_set_header Host $host;
                        proxy_set_header X-Real-IP $remote_addr;
                        proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                        proxy_set_header X-Forwarded-Proto $scheme;
                    }
                
                    location /health {
                        return 200 "healthy\n";
                        add_header Content-Type text/plain;
                    }
                }
            EOT
          + executable = false
          + file       = "/etc/nginx/conf.d/default.conf"
        }
    }

  # module.proxy.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "nginx:alpine"
      + repo_digest = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_container    = "ephemeral-pr-31-app"
  + app_url          = "http://localhost:8031"
  + db_container     = "ephemeral-pr-31-db"
  + db_database      = "ephemeral_pr_31"
  + db_host          = "localhost"
  + db_port          = 5463
  + drift_check_info = {
      + last_apply        = (known after apply)
      + provider_versions = {
          + docker = "~> 3.0"
        }
      + state_file        = "terraform.tfstate"
      + terraform_version = "1.5.0"
    }
  + health_endpoints = {
      + app_health   = "http://localhost:8031/health"
      + app_ready    = "http://localhost:8031/ready"
      + proxy_health = "http://localhost:9031/health"
    }
  + metrics_labels   = {
      + creation_time = (known after apply)
      + environment   = "ephemeral"
      + pr_number     = 31
      + stack_name    = "ephemeral-pr-31"
    }
  + pr_number        = 31
  + proxy_container  = "ephemeral-pr-31-proxy"
  + proxy_url        = "http://localhost:9031"
  + resource_count   = {
      + containers = 3
      + networks   = 1
      + total      = 5
      + volumes    = 1
    }
  + stack_containers = [
      + "ephemeral-pr-31-app",
      + "ephemeral-pr-31-proxy",
      + "ephemeral-pr-31-db",
    ]
  + stack_name       = "ephemeral-pr-31"
  + stack_urls       = {
      + app   = "http://localhost:8031"
      + proxy = "http://localhost:9031"
    }

```
</details>

**Stack Name:** `ephemeral-pr-31`

**Status:** Plan successful, proceeding to apply...
